app/Controllers/ControladorNoticia.php

SELECT *
FROM `noticias`
---
    public function index()
    {

        $modeloNoticia = model('ModeloNoticia');
        $datos['noticias'] = $modeloNoticia->findall(); //Se recuperan los datos de la tbla usuarios y se almacenan en el arreglo datos.

SELECT *
FROM `noticias`
WHERE `id_noticia` = '3'
---
    public function show($id = null)
    {
        $modeloNoticia = model('ModeloNoticia');
        $noticia = $modeloNoticia->getWhere(['id_noticia' => $id])->getResult();